sterentev/atdf-device-asm-include/inc/ATtiny861.inc
; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 19
.equ	INT_VECTORS_SIZE	= 0x26
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Reset, Power-on Reset and Watchdog Reset
;	1	INT0		; External Interrupt 0
;	2	PCINT		; Pin Change Interrupt
;	3	TIMER1_COMPA	; Timer/Counter1 Compare Match 1A
;	4	TIMER1_COMPB	; Timer/Counter1 Compare Match 1B
;	5	TIMER1_OVF	; Timer/Counter1 Overflow
;	6	TIMER0_OVF	; Timer/Counter0 Overflow
;	7	USI_START	; USI Start
;	8	USI_OVF		; USI Overflow
;	9	EE_RDY		; EEPROM Ready
;	10	ANA_COMP	; Analog Comparator
;	11	ADC		; ADC Conversion Complete
;	12	WDT		; Watchdog Time-Out
;	13	INT1		; External Interrupt 1
;	14	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	15	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	16	TIMER0_CAPT	; ADC Conversion Complete
;	17	TIMER1_COMPD	; Timer/Counter1 Compare Match D
;	18	FAULT_PROTECTION; Timer/Counter1 Fault Protection


; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET		; RESET		 - External Reset, Power-on Reset and Watchdog Reset
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt 0
;#		reti			; PCINT		 - Pin Change Interrupt
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match 1A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match 1B
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; USI_START	 - USI Start
;#		reti			; USI_OVF	 - USI Overflow
;#		rjmp	EE_RDY_ISR	; EE_RDY	 - EEPROM Ready
;#		reti			; ANA_COMP	 - Analog Comparator
;#		reti			; ADC		 - ADC Conversion Complete
;#		reti			; WDT		 - Watchdog Time-Out
;#		reti			; INT1		 - External Interrupt 1
;#		reti			; TIMER0_COMPA	 - Timer/Counter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer/Counter0 Compare Match B
;#		reti			; TIMER0_CAPT	 - ADC Conversion Complete
;#		reti			; TIMER1_COMPD	 - Timer/Counter1 Compare Match D
;#		reti			; FAULT_PROTECTION - Timer/Counter1 Fault Protection
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY861_INC_ */

; ************************ END OF FILE *********************************

